0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 5e-07;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"


    nozzle_inlet_m
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    nozzle_outlet_m
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    // walls
    nozzle_expand_wall_m
    {
        type            nutkWallFunction;
        Ks              uniform 100e-6;
        Cs              uniform 0.5;
        value           $internalField;
    }
    nozzle_fuel_wall_m
    {
        type            nutkWallFunction;
        Ks              uniform 100e-6;
        Cs              uniform 0.5;
        value           $internalField;
    }
    nozzle_radioactive_wall_m
    {
        type            nutkWallFunction;
        Ks              uniform 100e-6;
        Cs              uniform 0.5;
        value           $internalField;
    }
    nozzle_reaction_pre_wall_m
    {
        type            nutkWallFunction;
        Ks              uniform 100e-6;
        Cs              uniform 0.5;
        value           $internalField;
    }
    nozzle_reaction_wall_m
    {
        type            nutkWallFunction;
        Ks              uniform 100e-6;
        Cs              uniform 0.5;
        value           $internalField;
    }
}


// ************************************************************************* //
