0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    nozzle_outlet_m
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    nozzle_inlet_m
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }


    // walls
    nozzle_expand_wall_m
    {
        type            omegaWallFunction;
        blended         true;
        value           $internalField;
    }
    nozzle_fuel_wall_m
    {
        type            omegaWallFunction;
        blended         true;
        value           $internalField;
    }
    nozzle_radioactive_wall_m
    {
        type            omegaWallFunction;
        blended         true;
        value           $internalField;
    }
    nozzle_reaction_pre_wall_m
    {
        type            omegaWallFunction;
        blended         true;
        value           $internalField;
    }
    nozzle_reaction_wall_m
    {
        type            omegaWallFunction;
        blended         true;
        value           $internalField;
    }
}



// ************************************************************************* //
