system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Backup
//    (-1 -0.5 0)
//    ( 3 -0.5 0)
//    ( 3  0.5 0)
//    (-1  0.5 0)
//    (-1 -0.5 2)
//    ( 3 -0.5 2)
//    ( 3  0.5 2)
//    (-1  0.5 2)

scale   1;

vertices
(
    (-10 -50  10)
    ( 10 -50  10)
    ( 10 -50 -10)
    (-10 -50 -10)
    (-10  70  10)
    ( 10  70  10)
    ( 10  70 -10)
    (-10  70 -10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (4 8 4) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    domainBoundaryWalls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
        );
    }
);

// ************************************************************************* //
